Merge pull request #89 from wahid-nwr/feature/scheduling
Updated docs with recent implementations
